In [56]:
import pmdarima as pm
from pmdarima.model_selection import train_test_split
import numpy as np
import matplotlib.pyplot as plt

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from statsmodels.tsa.stattools import adfuller,acf, pacf
from statsmodels.tsa.arima_model import ARIMA
import statsmodels.api as sm
from pylab import rcParams

In [57]:
Oil_Prices = pd.read_csv("OIl.csv", delimiter=";")
Oil_Prices.head()

  Tanggal    Oil
0  Dec-98  10,41
1  Jan-99  11,44
2  Feb-99  10,75
3  Mar-99  13,17
4  Apr-99  15,87

In [58]:
Oil_Prices.dtypes

Tanggal    object
Oil        object
dtype: object

In [59]:
Oil_Prices.isnull().sum()

Tanggal    0
Oil        0
dtype: int64

In [60]:
Oil_Prices['Tanggal'] = pd.to_datetime(Oil_Prices['Tanggal'], format='%b-%y')
Oil_Prices['Oil'] = Oil_Prices['Oil'].str.replace(',', '.', regex=False).astype(float)
Oil_Prices.rename(columns={'Tanggal': 'Periode'}, inplace=True)
Oil_Prices.rename(columns={'Oil': 'Harga'}, inplace=True)
Oil_Prices

       Periode  Harga
0   1998-12-01  10.41
1   1999-01-01  11.44
2   1999-02-01  10.75
3   1999-03-01  13.17
4   1999-04-01  15.87
..         ...    ...
309 2024-09-01  72.42
310 2024-10-01  73.97
311 2024-11-01  72.29
312 2024-12-01  72.31
313 2025-01-01  78.16

[314 rows x 2 columns]

In [61]:
Inflation = pd.read_csv("Inflation.csv", delimiter=';')
Inflation.head()

  Tanggal     Data
0  Dec-98   1.41 %
1  Jan-99   2.96 %
2  Feb-99   1.27 %
3  Mar-99  -0.19 %
4  Apr-99  -0.67 %

In [62]:
Inflation.dtypes

Tanggal    object
Data       object
dtype: object

In [63]:
Inflation.isnull().sum()

Tanggal    0
Data       0
dtype: int64

In [64]:
Inflation['Tanggal'] = pd.to_datetime(Inflation['Tanggal'], format='%b-%y')
Inflation['Data'] = Inflation['Data'].str.replace(',', '.', regex=False).str.replace('%', '', regex=False).astype(float) / 100
Inflation.rename(columns={'Tanggal': 'Periode'}, inplace=True)
Inflation.rename(columns={'Data': 'Inflation Rate'}, inplace=True)
Inflation

       Periode  Inflation Rate
0   1998-12-01          0.0141
1   1999-01-01          0.0296
2   1999-02-01          0.0127
3   1999-03-01         -0.0019
4   1999-04-01         -0.0067
..         ...             ...
309 2024-09-01         -0.0012
310 2024-10-01          0.0008
311 2024-11-01          0.0030
312 2024-12-01          0.0044
313 2025-01-01         -0.0076

[314 rows x 2 columns]

In [65]:
Exchange_Rate = pd.read_csv("Exchange Rate.csv", delimiter=';')
Exchange_Rate.head()

  Tanggal  Harga (IDR-USD)
0  Dec-98           8000.0
1  Jan-99           8850.0
2  Feb-99           8800.0
3  Mar-99           8650.0
4  Apr-99           8017.5

In [66]:
Exchange_Rate.dtypes

Tanggal             object
Harga (IDR-USD)    float64
dtype: object

In [67]:
Exchange_Rate.isnull().sum()

Tanggal            0
Harga (IDR-USD)    0
dtype: int64

In [68]:
Exchange_Rate['Tanggal'] = pd.to_datetime(Exchange_Rate['Tanggal'], format='%b-%y')
Exchange_Rate.rename(columns={'Tanggal': 'Periode'}, inplace=True)
Exchange_Rate

       Periode  Harga (IDR-USD)
0   1998-12-01           8000.0
1   1999-01-01           8850.0
2   1999-02-01           8800.0
3   1999-03-01           8650.0
4   1999-04-01           8017.5
..         ...              ...
309 2024-09-01          15135.0
310 2024-10-01          15690.0
311 2024-11-01          15840.0
312 2024-12-01          16090.0
313 2025-01-01          16300.0

[314 rows x 2 columns]

In [70]:
Interest_Rate = pd.read_csv("BI Rate.csv")
Interest_Rate.head()

    Bulan  BI Rate
0  Dec-98    38.44
1  Jan-99    36.43
2  Feb-99    37.50
3  Mar-99    37.84
4  Apr-99    35.19

In [71]:
Interest_Rate.dtypes

Bulan       object
BI Rate    float64
dtype: object

In [72]:
Interest_Rate.isnull().sum()

Bulan      0
BI Rate    0
dtype: int64

In [73]:
Interest_Rate['Bulan'] = pd.to_datetime(Interest_Rate['Bulan'], format='%b-%y')
Interest_Rate.rename(columns={'BI Rate': 'Interest Rate'}, inplace=True)
Interest_Rate.rename(columns={'Bulan': 'Periode'}, inplace=True)
Interest_Rate

       Periode  Interest Rate
0   1998-12-01          38.44
1   1999-01-01          36.43
2   1999-02-01          37.50
3   1999-03-01          37.84
4   1999-04-01          35.19
..         ...            ...
309 2024-09-01           6.00
310 2024-10-01           6.00
311 2024-11-01           6.00
312 2024-12-01           6.00
313 2025-01-01           5.75

[314 rows x 2 columns]

In [74]:
Gold_Prices = pd.read_csv("Gold.csv", delimiter=';')
Gold_Prices.head()

  Tanggal    Gold
0  Dec-98  291,68
1  Jan-99  287,08
2  Feb-99  287,33
3  Mar-99  285,96
4  Apr-99  282,62

In [75]:
Gold_Prices.dtypes

Tanggal    object
Gold       object
dtype: object

In [76]:
Gold_Prices.isnull().sum()

Tanggal    0
Gold       0
dtype: int64

In [77]:
Gold_Prices['Tanggal'] = pd.to_datetime(Gold_Prices['Tanggal'], format='%b-%y')
Gold_Prices['Gold'] = Gold_Prices['Gold'].str.replace(',', '.', regex=False).astype(float)
Gold_Prices.rename(columns={'Gold': 'Harga'}, inplace=True)
Gold_Prices.rename(columns={'Tanggal': 'Periode'}, inplace=True)
Gold_Prices

       Periode    Harga
0   1998-12-01   291.68
1   1999-01-01   287.08
2   1999-02-01   287.33
3   1999-03-01   285.96
4   1999-04-01   282.62
..         ...      ...
309 2024-09-01  2570.55
310 2024-10-01  2690.08
311 2024-11-01  2651.13
312 2024-12-01  2648.01
313 2025-01-01  2709.69

[314 rows x 2 columns]